Revit 2027 API
BuiltInFailures.CopyPasteFailures.ElementRenamedOnPaste Property
 The loaded type "[Name]" has been renamed to "[New Name]" to avoid conflicts with the existing type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementRenamedOnPaste { get; }
Public Shared ReadOnly Property ElementRenamedOnPaste As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementRenamedOnPaste {
	FailureDefinitionId^ get ();
}
static member ElementRenamedOnPaste : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace